In [7]:
import pandas as pd

In [21]:
df = pd.DataFrame(
    {"foo": range(5), "bar": range(5, 10)}
   )

In [22]:
df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [23]:
pd.to_pickle(df, "./test.pkl")

# Or alternatively
df.to_pickle("./df_pickled.pkl")

In [24]:
unpickled_df = pd.read_pickle("./test.pkl")
unpickled_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [36]:
df.to_csv('./test.csv', index = False)

In [37]:
table_df = pd.read_table('./test.csv', delimiter = ',', index_col = None)

In [38]:
table_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [44]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Department': ['HR', 'Finance', 'IT', 'Finance', 'HR'],
    'Salary': [50000, 60000, 75000, 80000, 50000],
    'Joining_Date': ['2020-05-01', '2018-07-15', '2021-03-20', '2019-11-03', '2020-01-25']
}

df = pd.DataFrame(data)

Add a column Years_in_Company based on the Joining_Date.

In [45]:
from datetime import datetime

In [48]:
dateNow = datetime.now()
dateNow

datetime.datetime(2024, 11, 25, 20, 21, 35, 981619)

In [51]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

In [63]:
df['Years_in_Company'] = (dateNow - df['Joining_Date']).dt.days // 365

In [64]:
df

      Name  Age Department  Salary Joining_Date  Years_in_Company
0    Alice   25         HR   50000   2020-05-01                 4
1      Bob   30    Finance   60000   2018-07-15                 6
2  Charlie   35         IT   75000   2021-03-20                 3
3    David   40    Finance   80000   2019-11-03                 5
4      Eve   45         HR   50000   2020-01-25                 4

Find the average salary of employees in each department.

In [69]:
df.groupby('Department')['Salary'].mean().reset_index()

  Department   Salary
0    Finance  70000.0
1         HR  50000.0
2         IT  75000.0

Filter out employees who have been in the company for less than 3 years.

In [72]:
df[df['Years_in_Company'] <= 3]

      Name  Age Department  Salary Joining_Date  Years_in_Company
2  Charlie   35         IT   75000   2021-03-20                 3

Identify the department with the highest average salary.

In [78]:
df.groupby('Department')['Salary'].mean().idxmax()

'IT'